docs/research-topics/PIR.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Private Information Retrieval</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../style.css" />
</head>
<body>
<div id="content" class="content">
<ul class="sidebar" id="mySideNav">
  <a href="javascript:void(0);" class="icon" onclick="myFunction()"><b>MENU</b></a>
  <a href="../index.html">Home</a>
  <a class="active" href="../research-topics/_index.html">Research Topics</a>
  <a href="../publications.html">Publications</a>
  <a href="../projects/_index.html">Projects</a>
  <a href="../bio.html">Bio</a>
</ul>

<div class="logo">
<a class="logo__link" title="Kanishak Vaidya" rel="home">
<div class="logo__item logo__text">
<div class="logo__title">Kanishak Vaidya</div>
<div class="logo__tagline">PhD fellow in IISc Bangalore</div>
</div></a>
<!-- div style="float:right;">
  <div class="toggle-light light" ></div >
</div-->
</div>

<script>
function myFunction() {
  var x = document.getElementById("mySideNav");
  if (x.className === "sidebar") {
    x.className += " responsive";
  } else {
    x.className = "sidebar";
  }
}
</script>

<div id="outline-container-orgca3f8dd" class="outline-2">
<h2 id="orgca3f8dd">Introduction</h2>
<div class="outline-text-2" id="text-orgca3f8dd">
<p>
The problem of Private Information Retrieval (PIR), first described by Chor et. al. in &ldquo;Private information retrieval,&rdquo; Proceedings of IEEE 36th Annual Foundations of Computer Science, 1995, pp. 41-50, doi: 10.1109/SFCS.1995.492461., deals with privately retrieving data from a set of distributed servers. A user wishes to retrieve one file among a set of files stored across the servers. But the servers should not know the identity of the desired file. A PIR scheme that minimizes the download cost for the user is described by H. Sun and S. A. Jafar, in ``The Capacity of Private Information Retrieval,&rsquo;&rsquo; in IEEE Transactions on Information Theory, vol. 63, no. 7, pp. 4075-4088, July 2017, doi: 10.1109/TIT.2017.2689028. After that, the PIR problem is solved for various other settings.
</p>

<p>
In Private Information Retrieval (PIR) there is one user and a set of \(N\) files \(W_1 , \cdots , W_N\) replicated across \(S\) non-colluding servers. The user wants to retrieve one out of \(N\) files, say file \(W_{D}\), but does not want servers to know the identity of the file. In other words, the user wants to hide the index \(D\) from the servers. In order to retrieve this desired file privately, the user generates \(S\) queries and sends query \(Q_s^{D}\) to server \(s\). After receiving their respective queries, servers construct answers which are a function of the query they received and the files they are storing. After receiving answers from all the servers, the user should be able to decode the desired file.
</p>
</div>
</div>

<div id="outline-container-org3c46a40" class="outline-2">
<h2 id="org3c46a40">Our Contribution</h2>
<div class="outline-text-2" id="text-org3c46a40">
<p>
We considered the PIR problem in conjunction with another content delivery problem known as the problem. In this setup, there are \(B\) non-colluding servers storing \(N\) files. We propose a Private Information Retrieval scheme in which \(K\) users aided with \(C\) Multi-Access cache nodes privately retrieve data from distributed servers. We considered several multi-access setups with multiple non-colluding servers with all the messages replicated across the servers. Each server is connected to all the users via error-free broadcast links.
</p>
</div>

<div id="outline-container-org44f2d69" class="outline-3">
<h3 id="org44f2d69">Publications</h3>
<div class="outline-text-3" id="text-org44f2d69">
<ul class="org-ul">
<li>Kanishak Vaidya and B. Sundar Rajan, ``Cache-Aided Multi-Access Multi-User Private Information Retrieval,&rsquo;&rsquo; in Wi-Opt CCDWN 2022, Turin, Italy, 19 &#x2013; 23 September 2022.</li>
<li>Kanishak Vaidya and B. Sundar Rajan, ``Multi-Access Cache-Aided Multi-User Private Information Retrieval,&rsquo;&rsquo; arXiv:2201.11481, 9 Feb 2022.</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
